Tekla Open API Reference for Tekla Structures 2025
Part.PartAttributes Class
 The PartAttributes class is the attributes class for the part.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.Part.PartAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PartAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class PartAttributes
	Inherits AttributesBase
The Part.PartAttributes type exposes the following members.
Constructors
Name | Description
Part.PartAttributes()
 Creates a new default part attributes instance that loads standard attributes.
Part.PartAttributes(String)
 Creates a new part attributes instance that loads the specified attributes.
Top
Properties
Name | Description
CenterLine
 The line type of the center line.
CustomPresentation
 Custom presentation GUID to be applied to the object type
DrawCenterLine
 True if the center line is drawn.
DrawChamfers
 True if chamfers are drawn.
DrawConnectingSideMarks
 True if connecting side marks are drawn.
DrawHiddenLines
 True if hidden lines are drawn.
DrawOrientationMark
 True if the orientation mark is drawn.
DrawOwnHiddenLines
 True if own hidden lines are drawn.
DrawPopMarks
 True if pop marks are drawn.
DrawReferenceLine
 True if the reference line is drawn.
FaceHatch
 The hatch type of the face hatch.
HiddenLines
 The line type of hidden lines.
OwnHiddenLines
 The line type of own hidden lines.
PartialProfileLength
 Gets or sets the partial profile length.
PartialProfileOffset
 Gets or sets the partial profile offset.
ReferenceLine
 The line type of the reference line.
Representation
 The representation of the part.
SectionFaceHatch
 The hatch type of the section face hatch.
SectionLines
 The line type of section lines.
SymbolOffset
 The symbol offset.
VisibleLines
 The line type of visible lines.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace